Repository: salktbi902/ArabicAIKeyboard
Catalog: Demo/Demo/Localization/Localizable.xcstrings
Source language: en
Languages: ar

# Button.Done
source: Done
ar: تم

# Button.Cancel
source: Cancel
ar: إلغاء

# Button.Copy
source: Copy
ar: نسخ

# Button.Insert
source: Insert
ar: إدراج

# Button.Retry
source: Retry
ar: إعادة المحاولة

# Menu.CloseMenu
source: Close
ar: إغلاق

# Menu.Dictation
source: Dictation
ar: الإملاء الصوتي

# Menu.HostApp
source: Host App Info
ar: معلومات التطبيق

# Menu.Languages
source: Languages
ar: اللغات

# Menu.OpenApp
source: Demo App
ar: فتح التطبيق

# Menu.OpenWebsite
source: Website
ar: فتح الموقع

# Menu.ReadFullDocument
source: Read All Text
ar: قراءة النص الكامل

# Menu.Settings
source: Settings
ar: الإعدادات

# Menu.TextInput
source: Text Input
ar: إدخال نص

# Menu.Themes
source: Themes
ar: السمات

# Menu.AI
source: AI Assistant
ar: الذكاء الاصطناعي

# AI.Title
source: AI Assistant
ar: الذكاء الاصطناعي

# AI.Proofread
source: Proofread
ar: تدقيق لغوي

# AI.Translate
source: Translate
ar: ترجمة

# AI.Diacritics
source: Add Diacritics
ar: تشكيل

# AI.Improve
source: Improve
ar: تحسين النص

# AI.Summarize
source: Summarize
ar: تلخيص

# AI.Expand
source: Expand
ar: توسيع

# AI.Formal
source: Make Formal
ar: أسلوب رسمي

# AI.Casual
source: Make Casual
ar: أسلوب عامي

# AI.Reply
source: Smart Reply
ar: رد ذكي

# AI.Complete
source: Auto Complete
ar: إكمال تلقائي

# AI.Processing
source: Processing...
ar: جارٍ المعالجة...

# AI.Success
source: Success
ar: تم بنجاح

# AI.Error
source: Error
ar: حدث خطأ

# AI.EmptyText
source: Text is empty
ar: النص فارغ

# Settings.Title
source: Settings
ar: الإعدادات

# Settings.Language
source: Language
ar: اللغة

# Settings.Theme
source: Theme
ar: السمة

# Settings.Haptics
source: Haptic Feedback
ar: الاهتزاز

# Settings.Sound
source: Sound
ar: الصوت

# Settings.AI
source: AI Settings
ar: الذكاء الاصطناعي

# Settings.Keyboard
source: Keyboard
ar: لوحة المفاتيح

# Settings.Autocomplete
source: Autocomplete
ar: الإكمال التلقائي

# Settings.Autocorrect
source: Autocorrect
ar: التصحيح التلقائي

# Keyboard.Space
source: space
ar: مسافة

# Keyboard.Return
source: return
ar: إدخال

# Keyboard.Delete
source: delete
ar: حذف

source: OBS! This demo isn't code signed and therefore can't sync data with its keyboard. This means that dictation will not work.
ar: تنبيه: هذا العرض التجريبي غير موقّع رقمياً ولا يمكنه مزامنة البيانات مع لوحة المفاتيح. هذا يعني أن الإملاء الصوتي لن يعمل.

# Section.TextFields
source: Text Fields
ar: حقول النص

# Sheet.FullDocumentContext
source: Full Document Reader
ar: قارئ المستند الكامل

# Sheet.FullDocumentContext.Reading
source: Reading...
ar: جارٍ القراءة...

# Sheet.FullDocumentContext.ResultPrefix
source: Result:
ar: النتيجة:

# Sheet.Host
source: Host Application
ar: التطبيق المضيف

# Sheet.Host.Section.App
source: Host Application
ar: التطبيق المضيف

# Sheet.Host.Section.App.BundleId
source: Bundle ID
ar: معرّف الحزمة

# Sheet.Host.Section.App.CanOpen
source: Can Be Opened?
ar: هل يمكن فتحه؟

# Sheet.Host.Section.App.Name
source: Name
ar: الاسم

# Sheet.Host.Section.App.Unknown
source: The current host application is not known by KeyboardKit Pro. Reach out to get it added.
ar: التطبيق المضيف الحالي غير معروف لدى KeyboardKit Pro. تواصل معنا لإضافته.

# Sheet.Host.Section.BundleID
source: Host Application Bundle ID
ar: معرّف حزمة التطبيق المضيف

# Sheet.Host.Section.KnownApps
source: Known Apps
ar: التطبيقات المعروفة

# TextField.Email
source: Email...
ar: البريد الإلكتروني...

# TextField.Multiline
source: Multiline Text…
ar: نص متعدد الأسطر...

# TextField.NumberPad
source: Number Pad
ar: لوحة الأرقام

# TextField.Plain
source: Plain Text…
ar: نص عادي...

# TextField.URL
source: URL...
ar: رابط...

# TextField.WebSearch
source: Web Search…
ar: بحث في الويب...
